class HistoryModel {
  final String title;
  final String body;
  bool expanded;

  HistoryModel(
      {required this.title, required this.body, this.expanded = false});

  factory HistoryModel.fromJson(Map<String, dynamic> json) {
    return HistoryModel(
      title: json['title'],
      body: json['body'],
    );
  }
}

List<HistoryModel> historyList = [
  HistoryModel(
      title: 'التسمية والحدود',
      body:
          'كان أول من استخدم اسم فلسطين إشارة إلى جنوبي بلاد الشام هو المؤرخ الإغريقي هيرودوت في مؤلفاته من القرن ال5 ق.م. وقد استخدم هيرودوت اسم فلسطين كمصطلح جغرافي، حيث أشار إلى منطقتي بلاد الشام وبلاد الرافدين ك"سوريا" وإلى جنوبها ك"فلسطين" (Παλαιστινη "پَلَيْسْتِينِيه") أو "سوريا الفلسطينية". وعلى ما يبدو استعار هيرودوت هذا الاسم من اسم "پلشت" الذي أشار إلى الساحل الجنوبي ما بين يافا ووادي العريش حيث وقعت المدن الفلستينية. وكان الفلستينيون من شعوب البحر ومن أبرز الشعوب التي عاشت في منطقة فلسطين من القرن ال12 ق.م. ولمدة 500 عام على الأقل.'
          'ولم يستخدم اسم فلسطين كاسم منطقة ذات حدود سياسية معينة إلا في القرن الثاني للميلاد عندما ألغت سلطات الإمبراطورية الرومانية "ولاية يهوذا" (Provincia Iudaea) إثر التمرد اليهودي عليهم عام 132 للميلاد وإقامة "ولاية سوريا الفلسطينية" (Provincia Syria Palestinae) محلها.[بحاجة لمصدر]'
          'من الناحية الطوبوغرافية ونباتية يمكن استخدام معايير مختلفة لتحديد منطقة فلسطين، ولكنه يمكن بشكل عام وصفها كالمنطقة الممتدة من نهر الليطاني في لبنان شمالا إلى رأس خليج العقبة جنوبا، ومن البحر الأبيض المتوسط غربا إلى الضواحي الغربية للبادية السورية في الأردن شرقا. ويمكن أيضا اعتبار صحراء النقب جزءا طبيعيا من شبه جزيرة سيناء وعدم شموله بمنطقة فلسطين جغرافيا.'
          'والحدود المشار إليها اليوم كحدود فلسطين التاريخية هي نتيجة سلسلة من المفاوضات والاتفاقيات بين الإمبراطوريات التي سيطرت على الشرق الأوسط في مطلع القرن الـ 20 والتي أدت كذلك إلى تصميم الحدود السياسية في عموم الشرق الأوسط.'
          '¬حدود فلسطين التاريخية ("من النهر إلى البحر") هي البحر الأبيض المتوسط غربا، "خط رفح العقبة" الذي يفصلها عن سيناء من الجنوب الغربي، رأس خليج العقبة جنوبا، وادي عربه، البحر الميت ونهر الأردن شرقا، ومنحدر هضبة الجولان قرب شواطئ بحيرة طبريا الشرقية ومسار نهر الأردن الشمالي في الشمال الشرقي. ويحد فلسطين شمالا لبنان في خط متعرج يبتديء غربا برأس الناقورة على البحر الأبيض المتوسط، ثم يتجه شرقا إلى قرية يارون، فينعطف شمالا حتى المكان حيث وقعت في الماضي قريتي المالكية وقَدَس وحيث تقع بلدة المطلة ثم شرقا إلى تل القاضي وغربا إلى نقطة قرب منبع بانياس. ويشكل مسار الحدود الشمالي الشرقي صورة إصبع حيث أطلق على هذه المنطقة اسم "إصبع الجليل".'),
  HistoryModel(
      title: 'مكانة فلسطين الدينية(إسلامياً)',
      body:
          'لفلسطين مكانة كبيرة عند المسلمين، فهي بحسب معتقداتهم الأرض المباركة التي ذكرها الله في القرآن في عدة سوَر كما في سورة الإسراء: "سبحان الذي أسرى بعبده ليلا من المسجد الحرام إلى المسجد الأقصى الذي باركنا حوله". وذكر الله أرض فلسطين المباركة أيضا في كتابه : "نجيناه ولوطاً إلى الأرض التي باركنا فيها للعالمين" (الأنبياء، آية 71)، وأيضا حينما قال "ولسليمان الريح عاصفة تجري بأمره إلى الأرض التي باركنا فيها وكنا بكل شيء عالمين" (الأنبياء، آية 81)، وعندما أمر الله النبي موسى وبني إسرائيل بدخول فلسطين قال "وإذ قلنا ادخلوا هذه القرية فكلوا منها حيث شئتم رغداً وادخلوا الباب سجداً وقولوا حطّة نغفر لكم خطاياكم وسنزيد المحسنين" (البقرة، آية 58)، والقرية هي أريحا، وفي قوله "يا قوم ادخلوا الأرض المقدسة التي كتب الله لكم ولا ترتدوا على أدباركم فتنقلبوا خاسرين" (المائدة، آية 21). وذكر الله عن قصة مريم العذراء في كتابه "فحملته فانتبذت به مكانا قصياً" (مريم 22) والمكان المقصود هو وادي يقع بين بيت لحم و القدس [13]. وللقدس أهمية خاصة للمسلمين والمسجد الأقصى كما هو معروف بأنه أولى القبلتين ، ومنه عرج النبي محمد Mohamed peace be upon him.svg إلى السماء وبقي مسجد هذه المدينة قبلة للمسلمين مدة ستة عشر أو سبعة عشر شهراً ، حتى قال تعالى " قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام وحيثما كنتم فولوا وجوهكم شطره". فتحولت قبلة المسلمين بعدها إلى الكعبة في مكة المكرمة . ويطلق المسلمون اسم "بيت المقدس" أو "القدس" على المدينة لقدسيتها. كما يؤمن المسلمون بوجود مقام للنبي إبراهيم وأبنائه وأحفاده الأنبياء إسماعيل وإسحق و يعقوب وزوجاتهم داخل الحرم الإبراهيمي في الخليل.وفيها ولد عيسى ابن مريم عليه السلام ، وفي فلسطين العديد من المساجد التاريخية والشواهد الإسلامية مثل مسجد عمر ومسجد البراق في القدس والجامع العمري في غزة وبيت لحم بالإضافة لكثير من مقامات الأنبياء مثل مقام الخضر ومقام النبي الياس ومقام النبي داوود ومقام النبي صالح.'
          'وفي السيرة النبوية قال النبي محمد :" لا تُشد الرحال إلاّ إلى ثلاثة مساجد : المسجد الحرام ، ومسجدي هذا (المسجد النبوي) ، والمسجد الأقصى"'
          'وما يزيد تشريفا لأرض الشام وبيت المقدس هو فرض الصلوات الخمس على المسلمين من فوق أرضها ، وصلاة النبي إماماً بالأنبياء - حسب المعتقد الإسلامي تحت صخرتها المشرفة . حيث حدَّث رسول الله أصحابه المؤمنين ، وأخبرهم ما شاهده في السموات من الآيات ، وما تلقاه من الأمر الإلهي بفرض الصلوات الخمس اليومية .'),
  HistoryModel(
      title: 'مكانة فلسطين الدينية(مسيحياً)',
      body:
          'سمى فلسطين عند المسيحيين بالديار المقدسة، إذ بحسب الإيمان المسيحي، ولد وعاش فيها يسوع المسيح ورسله وحدثت معظم الأحداث المذكورة في العهد الجديد والعديد من الأحداث المذكورة في العهد القديم. وحسب التراث المسيحي انطلقت البشارة المسيحية من الجليل ويهوذا، أي من شمالي فلسطين وأوساطها، وانتشرت في أنحاء العالم. لذا تحتوي فلسطين على العديد من الأماكن المقدسة للمسيحيين وعلى رأسها مدينة بيت لحم، مسقط رأس المسيح حيث كنيسة المهد، ومدينة الناصرة حيث تلقت مريم العذراء البشارة بولادة المسيح من الروح القدس وحيث ترعرع المسيح بعد عودة أهله من بيت لحم، ومدينة القدس، أو أورشليم باسمها المسيحي التقليدي، حيث دعا المسيح أهل يهوذا إلى اتباعه إلى أن خطى خطواته الأخيرة على طريق الآلام ومن ثم تم صلبه ودفنه، إذ يؤمن المسيحيون بوجود قبر المسيح في كنيسة القيامة بالمدينة. وكذلك يقدس المسيحيين أماكن مختلفة في الجليل وخاصة حول بحيرة طبريا وعلى ضفة نهر الأردن. وكذلك يقدس المسيحيون بعض الأماكن المذكورة في العهد القديم والتي يقدسها اليهود والمسلمون أيضا مثل الحرم القدسي والحرم الإبراهيمي في الخليل وغيرهما. كانت المسيحية في فلسطين متأثرة منذ البداية باتجاهات مختلفة، فمنذ القرن الأول الميلادي تعايشت في الأراضي المقدسة عدة طوائف مسيحية مختلفة مع بعضها البعض. ولم ينقطع الوجود المسيحي في فلسطين إلى يومنا هذا.'
          'تعتبر كنيسة القيامة في القدس إحدى أهم الكنائس في العالم، ويحج إلى فلسطين آلاف المسيحيين سنويا قادمين إلى بيت لحم والقدس والناصرة.'),
  HistoryModel(
      title: 'مكانة فلسطين الدينية(يهودياً)',
      body:
          'يطلق اليهود على فلسطين اسم "إيرتس يسرائيل" (أي "بلاد إسرائيل") أو الأرض المقدسة أو أرض الميعاد، نسبة لما يقال عنها في التناخ (العهد القديم في المسيحية): "الأرض التي أقسم الرب لآبائكم إبراهيم وإسحاق ويعقوب أن يعطيها لهم ولنسلهم من بعدهم" (سفر التثنية، الأصحاح الأول، 8). بحسب الايمان اليهودي، كانت فلسطين الأرض التي أقيمت فيها مملكة إسرائيل، قبل انفصالها إلى مملكتي إسرائيل الشمالية ويهوذا، وينسب اليهود المعاصرين أنفسهم إلى أبناء مملكة يهوذا القديمة التي كانت عاصمتها أورشليم (أي مدينة القدس) والتي وقف فيها هيكل سليمان، وهو المركز اليهودي القديم. وتقدس طائفة السامريين القريبة من اليهود دينيا وثقافيا، جبل جرزيم قرب نابلس.(لا ننسا أن هنالك تحريف كبير في الثورة)'
          'في التراث اليهودي تعتبر القدس، الخليل، طبريا وصفد المدن المقدسة الأربع إذ توجد فيه أماكن ذات أهمية خاصة في الديانة اليهودية وفي تاريخ الشعب اليهودي. ويعتبر حائط المبكى (المسمى أيضا ب"الحائط الغربي"، أو ب"حائط البراق" عند المسلمين) أكثر مصلى يهودي أهمية في أيامنا ويحتشد أمامه المصلين اليهود على مدار السنة، وخاصة في الأعياد اليهودية. ويقدس اليهود الحرم الإبراهيمي في الخليل كما يقدسونه المسلمون والمسيحيون، وكذلك أماكن مختلفة في الجليل.'),
  HistoryModel(
      title: 'علم دولة فلسطين',
      body:
          'يتكون العلم من ثلاثة خطوط أفقية متماثلة، (من الأعلى للأسفل، أسود، وأبيض، وأخضر) فوقها مثلث أحمر متساوي الساقين قاعدته عند بداية العلم (القاعدة تمتد عموديا) ورأس المثلث واقع على ثلث طول العلم أفقيا.'
          'كان هذا العلم هو العلم العربي الأول الذي اقترحه العرب ليدل على القومية العربية. تشير الألوان الأبيض والأسود والأخضر إلي اسمي درجات الفداء في التاريخ العربي والإسلامي من السيرة النبوية المشرفة.'
          'فقد استمدت ألوان العلم من عدت رموز ذات مغزى ديني:'
          '1- اللون الأبيض هو اللون المميز للأنصار، وقد استخدمه الأمويين كرمز لهم.'
          '2- اللون الأسود هو اللون الذي ميز راية الرسول صلي الله عليه وسلم والتي سميت براية العقاب وهي الراية التي رفعها خالد ابن الوليد في فتوحاته لاسيما تلك التي وضعها بالمقربة من دمشق، وقد اتخذها العباسيين رمزا لهم.'
          '3- اللون الأخضر هو لون العباءة التي تغطي بها على بن أبي طالب رضي الله عنه يومي افتدي النبي ونام في فراشة.'
          ' 4- اللون الأحمر، وهو لون العصابة التي ربطها أبو دجالة في معركة بدر، حينما عاهد الله ورسوله أن لا يخرج من ارض المعركة وهو على قيد الحياة، فاستشهد فيها، وقد اتخذها الهاشميين رمزا لهم.'),
  HistoryModel(
      title: 'فلسطين قبل التاريخ',
      body:
          'وجدت آثار الوجود البشري في منطقة جنوبي بحيرة طبريا، هي ترقى إلى نحو 600,000 سنة قبل الميلاد. وفي العصر الحجري الحديث (10000 ق.م. - 5000 ق.م. ) انشأت المجتمعات الزراعية الثابتة ، ومن العصر النحاسي (5000 ق.م. - 3000 ق.م.) وجدت ادوات نحاسية وحجرية في جوار أريحا وبئر السبع والبحر الميت، ووصل الكنعانيون من شبه الجزيرة العربية إلى فلسطين بين 3000 ق.م. و 2500 ق.م. ، وفي نحو 1250 ق.م. استولى بني اسرائيل على بلاد كنعان، وما بين عامي 965 ق.م. و 928 ق.م. بنى الملك سليمان هيكلاً في القدس ، وفي عام 928 ق.م. قسمت دولة بني اسرائيل إلى مملكتي اسرائيل ويهودا وفي 721 ق.م. استولى الآشوريون على مملكة إسرائيل، وفي عام 586 ق.م. هزم البابليون بقيادة نبوخذ نصر مملكة يهودا وسبوا أهلها إلى بابل وهدموا الهيكل ، 539 ق.م. يستولي الفرس على بابل ويسمحون لبعض اليهود بالعودة، ويبنى الهيكل الثاني ، وفي عام 333 ق.م. يستولي الاسكندر الاكبر على بلاد فارس ويجعل فلسطين تحت الحكم اليوناني، وبموته وبحدود 323 ق.م. يتناوب البطالسة المصريين والسلوقيين السوريين على حكم فلسطين.'
          'حاول السلوقيون فرض الدين والثقافة الهلينيستية (اليونانية) ولكن في عام 165 ق.م. حسب التاريخ اليهودي يثور المكابيون على أنطيوخس إپيفانس السلوقي، حاكم سوريا، ويمضون في اقامة دولة يهودية مستقلة، وفي عام 63 ق.م. تضم فلسطين إلى الامبراطورية الرومانية.'),
  HistoryModel(
      title: 'فلسطين زمن روما وبيزنطة',
      body:
          'قام الحاكم الروماني بومباي العظيم بالسيطرة على فلسطين عام 63 ق.م. وجعل منها مقاطعة رومانية يحكمها ملوك يهود ، في سنة 70 للميلاد ، قمع الامبراطور الروماني تيتوس ثورة يهودية في فلسطين ، وسوى القدس بالارض ودمر معبدها. وفي اعقاب ثورة يهودية اخرى ما بين 132م و135م شيد الامبراطور هادريان مدينة وثنية جديدة على انقاض القدس اطلق عليها اسم كولونيا ايليا كابوتاليا ، وحرم على اليهود دخولها . وبعد انتهاء عهد هادريان ، زاد باطراد عدد المسيحيين المقيمين في القدس . ومع اعتناق الامبراطور قسطنطين الاول للمسيحية ، وزيارة امه الملكة هيلانة للقدس سنة 320م ، بدأ طابع القدس وفلسطين المسيحي يغلب على طابعهما الوثني. وشيّد قيطنطين نفسه كنيسة القيامة ، ودأب خلفائه، ولا سيما جستينيان على الاكثار من بناء الكنائس والنصب المسيحية في فلسطين . وسمح البيزنطيون لليهود بدخول القدس يوما واحدا في السنة فقط ، للبكاء قرب حجر كان لا يزال باقيا في موقع المعبد . ولكن البيزنطيين ابقوا على الموضع اجرد موحشا، اكراما لما كان قد تكهن به المسيح عليه السلام (انجيل متى 2:24) .'),
  HistoryModel(
      title: 'فلسطين صدر الاسلام والخلفاء الراشدين',
      body:
          'قبل ظهور الاسلام في القرن السابع ، كان قد حدث تمازج متصل بين المسيحيين في فلسطين والسكان العرب (الذين كان العديد منهم من المسيحيين ايضا) القاطنين إلى الجنوب والى الشرق من فلسطين. وكان النبي محمد صلى اللّه عليه وسلم واتباعه يتجهون إلى القدس كقبلة الصلاة ، وتروي الرواية الاسلامية اسراء النبي من مكة المكرمة إلى القدس وعروجه منها إلى السماء.'
          'وبعد معركة أجنادين وانتصار المسلمين فيها بدأ المسلمون يسيطرون على اراضي فلسطين ، وقد استولى العرب المسلمون على القدس من البيزنطيين سنة 637م ، اعرب الخليفة عمر بن الخطاب عن احترامه للمدينة بان تقبل بنفسه استسلامها ، وعامل اهلها برأفة واعتدال متميزيين ، وكتب لهم وثيقة أمان عرفت فيما بعد بالعهدة العمرية ، اعطاهم فيها امانا لأنفسهم واموالهم وكنائسهم وصلبانهم ، فمن خرج منها فهو آمن ومن أقام فهو آمن ، وشهد على ذلك خالد بن الوليد وعبد الرحمن بن عوف وعمرو بن العاص ، ومعاوية ابن ابي سفيان ، وقد اقرّ السير وليم فينز جيرالد "لم يحدق قط في التاريخ المؤسف للفتوحات حتى فتح القدس ونادرا منذ ذاك ، ان اظهر فاتح تلك المشاعر السخية التي اظهرها عمر للقدس ." وكان الاسم العربي الذي اطلق على القدس هو البيت المقدّس ، كمقابل للبيت الحرام . واصبحت ولاية فلسطين البيزنطية ولاية ادارية وعسكرية عربية اطلق عليها اسم جند فلسطين منذ ذاك.'),
  HistoryModel(
      title: 'فلسطين زمن الأمويين',
      body:
          'كانت عاصمة الأمويين دمشق، وكان معاوية قد نصب نفسه خليفة في القدس ، كما ان الخليفة الأموي الخامس عبد الملك، شيد المسجد الذي عرف ياسم قبة الصخرة ، كما شيّد الوليد بن عبد الملك المسجد الأقصى المجاور. وكان تفضيل الأمويين لفلسطين والقدس سياسي إلى حد ما، لأن مكة المكرمة كانت في يد خصوم بني أميّة في العقود الاولى، ولكن حتى بعدما دانت مكة المكرمة والمدينة المنورة بالولاء للأمويين سنة 692م ، فان الخليفة السابع سليمان، نصب على كرسي الخلافة في القدس ، وذلك يرجع إلى ما ذكره الحديث الشريف من ذكر فضل الصلاة و الزيارة والسكنى في القدس.'),
  HistoryModel(
      title: 'فلسطين زمن العباسيين',
      body:
          'اتخذ العباسيون من بغداد عاصمة لهم ، وبلغت الخلافة العباسية اوج سلطانها ونفوذها في غضون قرن من إنشائها ، امّا بعد ذلك ، فقد وقع الكثير من اراضي الامبراطورية تحت سلطان حكامها الذين كان ولائهم للخلافة العباسية اسميا ، وظلت فلسطين طوال الشطر الاكبر من الفترة الواقعة بين انتهاء القرن التاسع الميلادي وحتى الحملات الصليبية في نهاية القرن الحادي عشر للميلاد تحكم من قبل حكام مسلمين اتخذوا من القاهرة مقرا لهم.'
          'زارها من العباسيين اثنان من الخلفاء ، كان المنصور اولهما ، وهو ثاني الخلفاء العباسيين ، زار القدس مرتين وأمر بإصلاح التلف الذي لحق بالمدينة بسبب زلزال كان قد اصابها ، اما الخليفة الثاني فهو المهدي ، ثالث الخلفاء العباسيين ، زار القدس خصيصا لأداء شعائر الصلاة في المسجد الاقصى ، وقد أمر المأمون سابع الخلفاء العباسيين باجراء ترميمات كبرى في مسجد قبة الصخرة ، تحت اشراف شقيقة وخلفه المعتصم ، الذي كان انذاك مندوب الخليفة في سوريا .'),
  HistoryModel(
      title: 'فلسطين زمن الحروب الصليبية والحملات المضادة لها',
      body:
          'انقطع تسلسل الحكم العربي والاسلامي لفلسطين بفعل الغزو الصليبي واقامة مملكة القدس اللاتينية بين عامي 1099 و 1187 للميلاد، ولكن الحملات المضادة للصليبيين بقيادة صلاح الدين الايوبي وخلفائه استمرت حتى عام 1291، حيث استرد المسلمون آخر المعاقل الصليبية في قيصرية (قيسارية) وعكا ، وقد قام الصليبييون، بعد دخولهم القدس بتعذيب واحراق وذبح الاف من المسلمين العزّل من الرجال والنساء والاطفال، فضلا عن العدد القليل من الأهالي اليهود الذين التجأوا إلى معبدهم ، وقد قامت عدّة حروب في تلك الفترة حاول فيها القادة المسلمون تحرير فلسطين منها محاولة الوزير الأفضل الفاطمي التي باءت بالفشل.'),
  HistoryModel(
      title: 'فلسطين في عهد المماليك',
      body:
          'كان المماليك هم من اخرج آخر الصليبيين من فلسطين وهم من هزموا المنغول بقيادة هولاكو حفيد جنكيز خان ، وامتدت فترة سيطرتهم ما بين عامي 1260 إلى الفتح العثماني لمصر عام 1517 ، وظل اسمها "جند فلسطين" وقسمت إلى ستة أقضية هي:'
          'غزة'
          'اللد'
          'قاقون'
          'القدس'
          'الخليل'
          'نابلس'),
  HistoryModel(
      title: 'فلسطين تحت الحكم العثماني',
      body:
          'هزم العثمانيون المماليك في حدود 1517 وكانت الدولة العثمانية سيطرت على فلسطين عام 1516 ، وعينت القسطنطينية حاكما محليا عليها، كانت البلاد قد قسمت إلى خمسة مناطق تسمى سناجق هي سنجق القدس وغزة وصفد ونابلس واللجون، وكان الحكم إلى حد بعيد في أيدي السكان المحليين . وتم اعادة اعمار المرافق العامة في القدس على يد سليمان القانوني عام 1537.'
          '.وقعت أجزاء فلسطين المختلفة وعموم بلاد الشام تحت سيطرة عائلات وكيانات متعددة في فترة الدولة العثمانية تراوحت بين الولاء والعداء للدولة المركزية، راجع ظاهر العمر، معنيون'
          ' بين عامي 1831 و1840 قام محمد علي حاكم مصر بمد نفوذه على فلسطين ولبنان، وأدت سياساته إلى تعديل النظام الإقطاعي ، زادت الزراعة وحسّنت التعليم ، استردت الدولة العثمانية نفوذها على فلسطين في عام 1840 وبقيت فلسطين تحت الحكم العثماني حتى شتاء عامي 1917-1918 أي حتى الحرب العالمية الاولى، قسمت بعدها بحسب إتفاقية سايكس بيكو كغيرها من مناطق الشام والعراق .'),
  HistoryModel(
      title: 'فلسطين والغزو الصهيوني والحرب العالمية الأولي',
      body:
          'خلال الثمانينات من القرن التاسع عشر ، ادى نمو الشعور القومي في اوروبا وخصوصا في شرقها إلى بلورة الصهيونية ، وكان القرار الصهيوني في اواخر القرن التاسع عشر باستعمار فلسطين وتحويلها إلى دولة يهودية -بغض النظر عن وجود أهلها الاصليين ورغباتهم- سببا في بدء الطور الحديث المطرب من تاريخ فلسطين، واطلق عليه اسم القضية الفلسطينية ، فبدأ بناء المستعمرات الاسرائيلية والهجرة إلى فلسطين من مختلف انحاء اوروبا ، وبنيت اول مستوطنة صهيونية هي بتاح تكفا عام 1878 ، وكان فكر القادمين الجدد فكر علماني اساسا ، فالحركة الصهيونية هي بالاساس حركة علمانية ، وبدا تيودور هرتزل باقناع اغنياء اليهود بدعم الفكرة الصهيونية . وفي تلك الاثناء قامت الثورة العربية الكبرى ، وهزمت الدولة العثمانية، وتم تقسيم البلاد بحسب إتفاقية سايكس بيكو، وفي 2 نوفمبر عام 1917 ، اصدر وعد بلفور [1] الذي "نظر بعين العطف إلى قيام دولة يهودية في فلسطين. على أن يفهم جلياً أنه لن يؤتى بعمل من شأنه أن ينتقص من الحقوق المدنية والدينية التي تتمتع بها الطوائف غير اليهودية المقيمة الآن في فلسطين"، كان من ردود الفعل الفلسطيننية عقد أول مؤتمر وطني فلسطيني عام 1919 رافضا لوعد بلفور.'),
  HistoryModel(
      title: 'الإنتداب البريطاني',
      body:
          'في 1917، ضمن الحرب العالمية الأولى، احتل الجيش البريطاني المتجه من مصر منطقة فلسطين، وفي 1922 تأسس الانتداب البريطاني على فلسطين بموجب قرار عصبة الأمم في مؤتمر سان ريمو عام 1920. وأشارت شرعة الانتداب إلى "وعد بلفور"، الذي كانت الحكومة البريطانية قد نشرته في 2 نوفمبر 1917، أساسا للانتداب (الفقرة الثانية من مقدمة الشرعة)، والذي قال إن: "حكومة صاحب الجلالة (البريطاني) تنظر بعين العطف إلى تأسيس وطن قومي للشعب اليهودي في فلسطين، وستبذل غاية جهدها لتسهيل تحقيق هذه الغاية، على أن يفهم جلياً أنه لن يؤتى بعمل من شأنه أن ينتقص من الحقوق المدنية والدينية التي تتمتع بها الطوائف غير اليهودية المقيمة الآن في فلسطين". كان من ردود الفعل العربية الفلسطيننية لوعد بلفور عقد أول مؤتمر وطني فلسطيني عام 1919 رافضا له.'
          'وعقد عام 1920 مؤتمر سان ريمو حيث تقرر وضع فلسطين تحت الإنتداب البريطاني، وفي سنة 1922 منح الإنتداب على فلسطين لبريطانيا من عصبة الأمم. وتتابعت مظاهر الرفض العربي وتصاعدت أعمال العنف بين العرب والمهاجرين اليهود، ففي أغسطس 1929 تبدأ أعمال شغب تسفر عن مقتل 133 يهودي و 116 عربي.'),
  HistoryModel(
      title: 'الثورة الكبرى عام 1936',
      body:
          'تصاعدت الأحداث في فلسطين منذ مقتل عز الدين القسام ، وكان فرحان السعدي قد استمر بعده بتنظيم الهجمات المسلحة على القوافل البريطانية واليهودية في فلسطين حتى قبضت عليه القوات البريطانية، وفي 15 ابريل 1936 اشتبك الفلسطينيون مع جماعة من اليهود الصهيونيين في طريق نابلس - طولكرم ، فقتل ثلاثة من الفلسطينيين ، وفي الليلة التالية قتل فلسطينيين قرب مستعمرة بتاح تكفا ، وفي اليوم التالي جرت اشتباكات بين العرب واليهود في يافا وتل ابيب قتل فيها ثلاثة من اليهود ، ففرض نظام منع التجول في يافا وتل أبيب، واعلن قانون الطواريء.'),
  HistoryModel(
      title: 'الاضراب العام وإعلان الثورة',
      body:
          'في 20 أأبريل 1936 تألفت لجنة قومية في مدينة نابلس دعت البلاد إلى الإضراب العام المستمر حتى تبدل السلطات سياساتها ، واستجابت البلاد للدعوة وشمل الإضراب مختلف نواحي الحياة، وفي 25 ابريل أجمعت الأحزاب على تشكيل لجنة عربية عليا بقيادة الحاج أمين الحسيني وعضوية ممثلين عنها ، ودعت هذه اللجنة إلى الاستمرار في الاضراب حتى تبدل الحكومة سياستها تبديلا تاما وتوقف الهجرة اليهودية إلى فلسطين ومنع انتقال الأراضي إلى اليهود وانشاء حكومة وطنية نيابية ، وعمت التظاهرات المدن الفلسطينية ووقعت اشتباكات.'
          'في 8 مايو عقد مؤتمر اللجان القومية بدعوة من اللجنة العليا، تقرر فيه الاستمرار في الاضراب واعلان العصيان المدني بالامتناع عن دفع الضرائب اعتبارا من 15 مايو.'),
  HistoryModel(
      title: 'تقسيم فلسطين',
      body:
          'بعد انتهاء الحرب العالمية الثانية عام 1945 ، تصاعدت حدّة هجمات الجماعات الصهيونية على القوات البريطانية في فلسطين ، مما حدا ببريطانيا إلى احالة المشكلة الفلسطينية إلى الامم المتحدة ، وفي 28 ابريل بدأت جلسة الجمعية العامة التابعة للأمم المتحدة بخصوص قضية فلسطين ، واختتمت اعمال الجلسات في 15 مايو بقرار تأليف لجنة الامم المتحدة الخاصة بفلسطين (UNSCOP) ، وهي لجنة مؤلفة من 11 عضوا ، نشرت هذه اللجنة تقريرها في 8 سبتمبر الذي أيد معظم افرادها حل التقسيم ، بينما اوصى الاعضاء الباقون بحل فيدرالي ، فرفضت الهيئة العربية العليا اقتراح التقسيم اما الوكالة اليهودية فاعلنت قبولها بالتقسيم ، ووافق كل من الولايات الامريكية المتحدة والاتحاد السوفييتي على التقسيم على التوالي ، واعلنت الحكومة البريطانية في 29 اكتوبر عن عزمها على مغادرة فلسطين في غضون ستة اشهر اذا لم يتم التوصل إلى حل يقبله العرب والصهيونيون (انظر تقسيم فلسطين).'
          'وفي الفترة التي تلت ذلك ، تصاعدت وتيرة العمليات العسكرية من جميع الاطراف ، وكانت لدى الصهاينة خطط مدروسة قامت بتطبيقها وكانت تسيطر على كل منطقة تنسحب منها القوات البريطانية ، في حين كان العرب في حالة تأزم عسكري بسبب التأخر في القيام باجرائات فعّالة لبناء قوة عربية نظامية تدافع عن فلسطين ، ونجحت القوات الصهيونية باحتلال مساحات تفوق ما حصلت عليه في قرار التقسيم ، وخرجت اعداد كبيرة من الفلسطينيين من مدنهم وقراهم بسبب المعارك او بسبب الخوف من المذابح التي سمعوا بها.'
          'وفي 13 مايو وجه حاييم وايزمان رسالة إلى الرئيس الامريكي ترومان يطلب فيها منه الايفاء بوعده الاعتراف بدولة يهودية ، واعلن عن قيام دولة اسرائيل في تل ابيب بتاريخ 14 مايو الساعة الرابعة بعد الظهر ، وغادر المندوب السامي البريطاني مقره الرسمي في القدس متوجها إلى بريطانيا ، وفي اول دقائق من 15 مايو انتهى الانتداب البريطاني على فلسطين وأصبح الاعلان عن قيام دولة اسرائيل نافذ المفعول ، واعترفت الولايات الامريكية المتحدة بدولة اسرائيل بعد ذلك بعشرة دقائق ، ولكن القتال استمر ولكن هذه الآن اصبحت الحرب بين دولة اسرائيل والدول العربية المجاورة.'
          'مع نهاية الحرب كانت إسرائيل قد أصبحت واقعا ، وسيطرت على مساحات تفوق ما نص عليه قرار تقسيم فلسطين ، وإحتلت من فلسطين (حسب تقسيم الانتداب البريطاني) كامل السهل الساحلي بإستثناء قطاع غزة الذي سيطر عليه المصريون ،كما قامت على كامل النقب والجليل وشمال فلسطين ، وأصبحت مناطق القدس الشرقية والضفة الغربية جزءا من المملكة الأردنية الهاشمية.'),
  HistoryModel(
      title: 'العدوان الثلاثي عام 1956',
      body:
          'في ليلة 29 أكتوبر سنة 1956 بدأت القوات الإسرائيلية بضرب سيناء ، في 5 نوفمبر دخلت القوات البريطانية بور سعيد وتعرضت بور فؤاد لهجوم من قبل القوات الفرنسية، وظلت إسرائيل تحتل غزّة لفترة 6 أشهر حتى مارس ‏1957.'),
  HistoryModel(
      title: 'حرب 1967',
      body:
          'في عام 1967 قام الجيش الاسرائيلي باحتلال الضفة الغربية من نهر الأردن التي كانت في ذلك الحين جزء من الأردن ، كما احتلت قطاع غزة وشبه جزيرة سيناء المصرية و هضبة الجولان السورية بالاضافة إلى مناطق اردنية اخرى في الشمال ، وعرفت هذه الحرب باسم حرب الايام الستة ، ودخلت القاموس الفلسطيني باسم النكسة.'),
  HistoryModel(
      title: 'الانتفاضة الفلسطينية 1987 (أطفال الحجارة)',
      body:
          'قام الفلسطينيون بهبة جماهيرية عام 1987 وحتى 1993 عرفت بإسم الإنتفاضة الأولى أو إنتفاضة أطفال الحجارة، كانت هذه الإنتفاضة سببا في نشوء ضغوط دولية على إسرائيل.'),
  HistoryModel(
      title: 'السلطة الوطنية الفلسطينية والحكم الذاتي',
      body:
          'كان قيام حكم ذاتي فلسطيني محدود في غزة ومناطق معينة من الضفة الغربية عام 1994 هو بداية لأسترداد بعض حقوق الفلسطينين ، و في عام 1996 أقيمت إنتخابات رئاسية فاز بها ياسر عرفات على منافسته الوحيدة سميحة خليل .'
          'في عام 1997 تم الإتفاق بين منظمة التحرير الفلسطينية وإسرائيل على ما عرف بإسم إتفاق الخليل الذي ترتب عليه إنسحاب القوات الإسرائيلية من مناطق مأهولة بالفلسطينيين وبقاء مناطق تحت السيطرة الإسرائيلية في البلدة القديمة والطرق المؤدية إليها .'),
  HistoryModel(
      title: 'الانتفاضة الفلسطينية 2000 (انتفاضة الأقصى)',
      body:
          'كانت بداية انتفاضة الاقصى في تاريخ 28 سبتمبر 2000 ردة فعل شعبية على دخول أريل شارون أحد باحات المسجد الاقصى المبارك.'
          'في يونيو 2002 بدأت الحكومة الإسرائيلية ببناء جدار فاصل داخل الضفة الغربية، قائلة بأن الهدف من بناء الجدار هو حماية مواطنيها من "الهجمات الإرهابية" والحفاظ على أمنها، وأدى بناء الجدار إلى تحديد الحركة بين مناطق الضفة الغربية، كما حدّ من الحركة إلى إسرائيل بالإضافة إلى خلق مناطق مغلقة وجيوب محصورة خلف الجدار لا يستطيع السكان الفلسطينيون الوصول إليها إلا بتصاريح خاصة، وكذلك إلى حصر ما يقدر ب 5000 فلسطيني خلف الجدار.'
          'في 9 يناير 2005 إستلم محمود عباس لمنصب الرئاسة للسلطة الوطنية الفلسطينية بعيد وفاة ياسر عرفات الذي يظل يشغل هذا المنصب حتى وفاته وإقامة إنتخابات رئاسية. وعام 2006 إقيمت الإنتخابات التشريعة الثانية في الضفة الغربية وقطاع غزة، أسفرت عن نجاح حركة حماس بالأغلبية النيابية في المجلس التشريعي الفلسطيني، وهو ما اعتبر تغيير كبير على الخارطة السياسية الفلسطينية، وتعرض الفلسطينيون بعدها لضغوط دولية تمثلت في تغيير سياسة الدول المانحة في تحويلها للأموال للسلطة الوطنية الفلسطينية أو إيقافها تماما مما أدى إلى ضائقة مالية خانقة تعرضت لها مؤسسات السلطة، كما ظهرت خلافات داخلية عدّة تطورت أحيانا إلى مواجهات مسلّحة على خلفية خلافات سياسية بين الفصائل الفلسطينية.'),
];
